gabaritovr6flexao/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
bottom
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    inlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    airfoil
    {
        type            oscillatingDisplacement;
        origin          (0.5 0 0);;
		omega           12.5664; 
        amplitude       (0 0.025 0);
        value           uniform (0 0 0);

    }

    front
    {
        type            empty;
    }
  back
    {
        type            empty;
    }
}

